const note=[
  {
    "version":"1.0.45",
    "content":[
      "1. 新增 \"界面\"设置二级菜单，若你的设备运行此Web应用时卡顿，可尝试前往 设置>界面 开启功能。",
      "2. 修复 \"公式转译\"无法进行转译的问题。"
    ]
  },
  {
    "version":"1.0.46",
    "content":[
      "1. 新增 上下文记忆(Beta) ，让模型能够知道过去的会话。",
      "2. 修复 模型无法输出正常结果的问题。",
      "3. 新增 更多大模型。"
    ]
  },
  {
    "version":"1.0.50",
    "content":[
      "1. 新增 更多大模型。",
      "2.优化 可拓展性。",
      "<p style='color: gray;'>提示：大多数模型因为是Token计费，对于成本考虑，因此未加入上下文记忆功能。支持的模型详情请<span style='color: #56a9ff;' onclick='settw(`note`,1);setTimeout(()=>settw(`memory`,0),300);'>点击此处跳转</span>查看。</p>"
    ]
  }
];