const note=[
  {
    "version":"1.0.45",
    "content":[
      "1. 新增 \"界面\"设置二级菜单，若你的设备运行此Web应用时卡顿，可尝试前往 设置>界面 开启功能。",
      "2. 修复 \"公式转译\"无法进行转译的问题。"
    ]
  },
  {
    "version":"1.0.46",
    "content":[
      "1. 新增 上下文记忆(Beta) ，让模型能够知道过去的会话。",
      "2. 修复 模型无法输出正常结果的问题。",
      "3. 新增 更多大模型。"
    ]
  },
  {
    "version":"1.0.50",
    "content":[
      "1. 新增 更多大模型。",
      "2. 优化 可拓展性。",
      "<p style='color: gray;'>提示：大多数模型因为是Token计费，对于成本考虑，因此未加入上下文记忆功能。支持的模型详情请<span style='color: #56a9ff;' onclick='settw(`note`,1);setTimeout(()=>settw(`memory`,0),300);'>点击此处跳转</span>查看。</p>"
    ]
  },
  {
    "version":"1.0.60",
    "content":[
      "1. 新增 实时公式转译。",
      "2. 修复 API返回出错的问题。",
      "<p style='color: gray;'>提示：开启实时公式转译功能(默认开启)后，可能导致卡顿。你可以前往 设置>界面>实时公式转译 设置或者<span style='color: #56a9ff;' onclick='settw(`note`,1);setTimeout(()=>settw(`ui`,0),300);'>点击此处前往</span>。</p>"
    ]
  },
  {
    "version":"1.0.61",
    "content":[
      "1. 加入 更多模型",
      "2. 删减 不可用模型",
      "3. 新增 开发者的话",
      "4. 优化 状态锁逻辑",
      "5. 新增 加载动画"
    ]
  },
  {
    "version":"1.0.62",
    "content":[
      "1. 加入 更多模型",
      "2. 新增 调整公式转译时间间隔",
      "3. 新增 部分场景液态玻璃折射效果"
    ]
  },
  {
    "version":"1.1.1(重要更新)",
    "content":[
      "1. 重构 Markdown转译器，丢弃自研转译方案，由Marked.js进行转译，大幅提升转译精度，新增表格转译等语法",
      "2. 重写 原生alert方法，UI更美观"
    ]
  },
  {
    "version":"1.2.1",
    "content":[
      "1. 重写 消息记录页面及其逻辑，UI更美观。",
      "2. 删除 不可用模型。"
    ]
  },
  {
    "version":"1.3.1",
    "content":[
      "1. 新增 Qwen3-VL多模态模型，可进行图片上传。",
      "2. 新增 更多模型。"
    ]
  },
  {
    "version":"1.3.2",
    "content":[
      "1. 修复 相机界面预览框比例问题。",
      "2. 调整 相机拍摄实际成片比例及像素数量。",
      "3. 新增 相机预览框自适应。"
    ]
  }
];